# This is Jeopardy!

#### Overview

This project is slightly different than others you have encountered thus far. Instead of a step-by-step tutorial, this project contains a series of open-ended requirements which describe the project you'll be building. There are many possible ways to correctly fulfill all of these requirements, and you should expect to use the internet, Codecademy, and/or other resources when you encounter a problem that you cannot easily solve.

#### Project Goals

You will work to write several functions that investigate a dataset of _Jeopardy!_ questions and answers. Filter the dataset for topics that you're interested in, compute the average difficulty of those questions, and train to become the next Jeopardy champion!

## Prerequisites

In order to complete this project, you should have completed the Pandas lessons in the <a href="https://www.codecademy.com/learn/paths/analyze-data-with-python">Analyze Data with Python Skill Path</a>. You can also find those lessons in the <a href="https://www.codecademy.com/learn/data-processing-pandas">Data Analysis with Pandas course</a> or the <a href="https://www.codecademy.com/learn/paths/data-science/">Data Scientist Career Path</a>.

Finally, the <a href="https://www.codecademy.com/learn/practical-data-cleaning">Practical Data Cleaning</a> course may also be helpful.

## Project Requirements

1. We've provided a csv file containing data about the game show _Jeopardy!_ in a file named `jeopardy.csv`. Load the data into a DataFrame and investigate its contents. Try to print out specific columns.

   Note that in order to make this project as "real-world" as possible, we haven't modified the data at all - we're giving it to you exactly how we found it. As a result, this data isn't as "clean" as the datasets you normally find on Codecademy. More specifically, there's something odd about the column names. After you figure out the problem with the column names, you may want to rename them to make your life easier for the rest of the project.
   
   In order to display the full contents of a column, we've added this line of code for you:
   
   ```py
   pd.set_option('display.max_colwidth', None)
   ```

In [1]:
import pandas as pd
pd.set_option('display.max_colwidth', None)

import jeopardy as jp

In [2]:
data = pd.read_csv('jeopardy.csv')
print(data.shape)
data.head()

(216930, 7)

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,"No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves",Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,"The city of Yuma in this state has a record average of 4,055 hours of sunshine each year",Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", this company served its billionth burger",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Constitution of Mass., second President of the United States",John Adams

Rename the columns using camel-case for easy access

Note: 'round' is a pandas function that causes conflicts later, so cannot use the camel_case short cut to access this column

In [3]:
data.columns
data.rename(columns = {'Show Number':'show_number', ' Air Date': 'air_date', ' Round': 'round', ' Category': 'category',
                       ' Value': 'value', ' Question': 'question', ' Answer': 'answer'}, inplace=True)
data.columns

Index(['show_number', 'air_date', 'round', 'category', 'value', 'question',
       'answer'],
      dtype='object')

2. Write a function that filters the dataset for questions that contains all of the words in a list of words. For example, when the list `["King", "England"]` was passed to our function, the function returned a DataFrame of 49 rows. Every row had the strings `"King"` and `"England"` somewhere in its `" Question"`.

   Test your function by printing out the column containing the question of each row of the dataset.

#### See the other notebook for details on this function

3. Test your original function with a few different sets of words to try to find some ways your function breaks. Edit your function so it is more robust.

   For example, think about capitalization. We probably want to find questions that contain the word `"King"` or `"king"`.
   
   You may also want to check to make sure you don't find rows that contain substrings of your given words. For example, our function found a question that didn't contain the word `"king"`, however it did contain the word `"viking"` &mdash; it found the `"king"` inside `"viking"`. Note that this also comes with some drawbacks &mdash; you would no longer find questions that contained words like `"England's"`.

#### Here, I'll use the original filter that filters for any match in the string, for example, king matches with making or working

In [4]:
data2 = jp.filtered_df(data, filter_function=jp.keyword_string_filter, word_filter=["King", "England"])

In [5]:
data2

,show_number,air_date,round,category,value,question,answer
4953,3003,1997-09-24,Double Jeopardy!,"""PH""UN WORDS",$200,"Both England's King George V & FDR put their stamp of approval on this ""King of Hobbies""",Philately (stamp collecting)
6337,3517,1999-12-14,Double Jeopardy!,Y1K,$800,"In retaliation for Viking raids, this ""Unready"" king of England attacks Norse areas of the Isle of Man",Ethelred
9191,3907,2001-09-04,Double Jeopardy!,WON THE BATTLE,$800,This king of England beat the odds to trounce the French in the 1415 Battle of Agincourt,Henry V
11710,2903,1997-03-26,Double Jeopardy!,BRITISH MONARCHS,$600,"This Scotsman, the first Stuart king of England, was called ""The Wisest Fool in Christendom""",James I
13454,4726,2005-03-07,Jeopardy!,A NUMBER FROM 1 TO 10,$1000,It's the number that followed the last king of England named William,4
...,...,...,...,...,...,...,...
208295,4621,2004-10-11,Jeopardy!,THE VIKINGS,$600,In 1066 this great-great grandson of Rollo made what some call the last Viking invasion of England,William the Conqueror
208742,4863,2005-11-02,Double Jeopardy!,BEFORE & AFTER,"$3,000",Dutch-born king who ruled England jointly with Mary II & is a tasty New Zealand fish,William of Orange roughy
213870,5856,2010-02-15,Double Jeopardy!,URANUS,$1600,In 1781 William Herschel discovered Uranus & initially named it after this king of England,George III
216021,1881,1992-11-09,Double Jeopardy!,HISTORIC NAMES,$1000,"His nickname was ""Bertie"", but he used this name & number when he became king of England in 1901",Edward VII
216789,5070,2006-09-29,Double Jeopardy!,ANCIENT HISTORY,$1200,"This kingdom of England grew from 2 settlements, one founded around 495 by Cerdic & his son Cynric",Wessex

In [6]:
print("This function returns the questions:\n\t'{}'\n\t'{}'\nthat don't contain the word king.".format(data2.loc[51986, 'question'],
                                                                                                    data2.loc[35478,'question']))

This function returns the questions:
	'This associate of Marx wrote about "the condition of the working class in England in 1844"'
	'Born in Bedfordshire, England in 1628, he was making "Progress" from the start'
that don't contain the word king.

#### Use my other word filter to obtain direct matches- it splits the question word into a list to find direct matches

In [7]:
# the default keyword filter function is: jp.keyword_filter
data3 = jp.filtered_df(data, word_filter=["King", "England"])

In [8]:
data3

,show_number,air_date,round,category,value,question,answer
6337,3517,1999-12-14,Double Jeopardy!,Y1K,$800,"In retaliation for Viking raids, this ""Unready"" king of England attacks Norse areas of the Isle of Man",Ethelred
9191,3907,2001-09-04,Double Jeopardy!,WON THE BATTLE,$800,This king of England beat the odds to trounce the French in the 1415 Battle of Agincourt,Henry V
13454,4726,2005-03-07,Jeopardy!,A NUMBER FROM 1 TO 10,$1000,It's the number that followed the last king of England named William,4
14912,2832,1996-12-17,Jeopardy!,WORLD HISTORY,$100,"This country's King Louis IV was nicknamed ""Louis From Overseas"" because he was raised in England",France
18076,3227,1998-09-22,Double Jeopardy!,WORLD HISTORY,$1000,In 1199 this crusader king of England was mortally wounded while besieging the castle of Chalus,Richard the Lionhearted
...,...,...,...,...,...,...,...
200369,2937,1997-05-13,Jeopardy!,BRITISH HISTORY,$200,8th C. King Offa built a 170-mile north-south dike that still partly marks the border of England & this country,Wales
201168,3515,1999-12-10,Jeopardy!,BEFORE & AFTER,$500,Popular Saint-Exupery character waiting around to become king of England,The Little Prince of Wales
208742,4863,2005-11-02,Double Jeopardy!,BEFORE & AFTER,"$3,000",Dutch-born king who ruled England jointly with Mary II & is a tasty New Zealand fish,William of Orange roughy
213870,5856,2010-02-15,Double Jeopardy!,URANUS,$1600,In 1781 William Herschel discovered Uranus & initially named it after this king of England,George III
216021,1881,1992-11-09,Double Jeopardy!,HISTORIC NAMES,$1000,"His nickname was ""Bertie"", but he used this name & number when he became king of England in 1901",Edward VII

In [9]:
# print(data3.loc[51986, 'question'])
# print(data3.loc[35478,'question'])
print("Trying to print the above two questions that are in the other data frame produce key erros")

Trying to print the above two questions that are in the other data frame produce key erros

4. We may want to eventually compute aggregate statistics, like `.mean()` on the `" Value"` column. But right now, the values in that column are strings. Convert the`" Value"` column to floats. If you'd like to, you can create a new column with float values.

   Now that you can filter the dataset of question, use your new column that contains the float values of each question to find the "difficulty" of certain topics. For example, what is the average value of questions that contain the word `"King"`?
   
   Make sure to use the dataset that contains the float values as the dataset you use in your filtering function.

#### Use the keyword string filter to match the solutions output from codecademy

In [10]:
king_df = jp.float_value_column_df(jp.filtered_df(data, filter_function=jp.keyword_string_filter, word_filter=["King"]))

In [11]:
king_df.shape

(7409, 8)

In [12]:
king_df.new_value.mean()

771.8833850722094

5. Write a function that returns the count of unique answers to all of the questions in a dataset. For example, after filtering the entire dataset to only questions containing the word `"King"`, we could then find all of the unique answers to those questions. The answer "Henry VIII" appeared 55 times and was the most common answer.

In [13]:
king = pd.DataFrame(jp.answer_frequency(king_df))

In [14]:
king

                         answer
Henry VIII                   55
Solomon                      35
Richard III                  33
Louis XIV                    31
David                        30
...                         ...
Mary, George, Elizabeth       1
Strings                       1
Baseball                      1
Louis XIII                    1
Sturgeon                      1

[5268 rows x 1 columns]

#### Use my filter to check the king stats

In [15]:
king_df = jp.float_value_column_df(jp.filtered_df(data, word_filter=["King"]))
king_df

,show_number,air_date,round,category,value,question,answer,new_value
40,4680,2004-12-31,Double Jeopardy!,DR. SEUSS AT THE MULTIPLEX,$1200,"<a href=""http://www.j-archive.com/media/2004-12-31_DJ_26.mp3"">Ripped from today's headlines, he was a turtle king gone mad; Mack was the one good turtle who'd bring him down</a>",Yertle,1200.0
781,4335,2003-06-06,Jeopardy!,MY PLACE?,$200,"A Norman could say, ""I'm the king of the motte-and-bailey style of"" this",castle,200.0
811,4335,2003-06-06,Double Jeopardy!,"""S""-OTERICA",$400,"Examples of this TV format include ""Leave It to Beaver"" & ""The King of Queens""",sitcom,400.0
846,4541,2004-05-10,Jeopardy!,U.S. STATES,$400,It's the only U.S. state named for a French king,Louisiana,400.0
896,3834,2001-04-12,Jeopardy!,AIN'T THAT AMERICA,$200,This state was named for a man who was a European king from 1643 to 1715,Louisiana,200.0
...,...,...,...,...,...,...,...,...
216232,1251,1990-01-29,Jeopardy!,"THANKS, GUYS",$400,"When we need to know about this, the King of Beers, we call Mary McHugh",Budweiser,400.0
216445,3644,2000-06-08,Final Jeopardy!,THE BIBLE,None,"According to the King James Version of the Bible, the number of people on Noah's Ark",8,0.0
216612,2046,1993-06-28,Double Jeopardy!,BIBLICAL PEOPLE,$600,Her 2 husbands were Uriah the Hittite & David the king,Bathsheba,600.0
216752,5070,2006-09-29,Jeopardy!,SIGNING OFF,$200,"Upon signing his name in 1776 he said, ""There, King George will be able to read that without his spectacles""",(John) Hancock,200.0
216777,5070,2006-09-29,Double Jeopardy!,ANCIENT HISTORY,$400,The first one of these tombs was built about 2650 B.C. by Imhotep for King Zoser & rose about 200 feet using steps,a pyramid (the pyramids accepted),400.0

In [16]:
king_df.new_value.mean()

805.4698795180723

In [17]:
king = pd.DataFrame(jp.answer_frequency(king_df))
king

                            answer
Henry VIII                      41
Sweden                          24
Solomon                         23
Norway                          22
Richard III                     21
...                            ...
Selma                            1
The Little Mermaid               1
zlati                            1
King Henry VIII                  1
I'll Be Home For Christmas       1

[1165 rows x 1 columns]

6. Explore from here! This is an incredibly rich dataset, and there are so many interesting things to discover. There are a few columns that we haven't even started looking at yet. Here are some ideas on ways to continue working with this data:

 * Investigate the ways in which questions change over time by filtering by the date. How many questions from the 90s use the word `"Computer"` compared to questions from the 2000s?
 * Is there a connection between the round and the category? Are you more likely to find certain categories, like `"Literature"` in Single Jeopardy or Double Jeopardy?
 * Build a system to quiz yourself. Grab random questions, and use the <a href="https://docs.python.org/3/library/functions.html#input">input</a> function to get a response from the user. Check to see if that response was right or wrong.

In [18]:
from datetime import datetime

dt_converter = lambda time: datetime.strptime(time, '%Y-%m-%d')

In [19]:
dt_air_date = data['air_date'].apply(dt_converter)
data['air_date'] = dt_air_date

In [22]:
data.air_date.describe()

count                  216930
unique                   3640
top       2007-11-13 00:00:00
freq                       62
first     1984-09-10 00:00:00
last      2012-01-27 00:00:00
Name: air_date, dtype: object

In [26]:
data.shape

(216930, 7)

In [60]:
data[data.air_date < "1990-01-01"].sort_values(by='air_date')

,show_number,air_date,round,category,value,question,answer,decade
84545,1,1984-09-10,Jeopardy!,ACTORS & ROLES,$500,"Sam Shepard played this barrier breaker in ""The Right Stuff""",Colonel Chuck Yeager,1980
84539,1,1984-09-10,Jeopardy!,INVENTIONS,$400,This fastener gets its name from a brand of galoshes it was used on,the zipper,1980
84538,1,1984-09-10,Jeopardy!,LAKES & RIVERS,$400,American river only 33 miles shorter than the Mississippi,the Missouri,1980
84537,1,1984-09-10,Jeopardy!,ACTORS & ROLES,$300,"He may ""Never Say Never Again"" when asked to be Bond",Sean Connery,1980
84536,1,1984-09-10,Jeopardy!,FOREIGN CUISINE,$300,Jewish crepe filled with cheese,a blintz,1980
...,...,...,...,...,...,...,...,...
81344,1230,1989-12-29,Jeopardy!,"BY ""GEORGE""",$300,This producer-screenwriter from California created a popular character named Indiana,George Lucas,1980
81345,1230,1989-12-29,Jeopardy!,HODGEPODGE,$300,"Plate pressure is compressing the Mediterranean, but this sea, bordering Greece, is expanding",Aegean Sea,1980
81346,1230,1989-12-29,Jeopardy!,NORTH ON THE MAP,$300,"North Head is a promontory on the entrance to Port Jackson, this Australian city's harbor",Sydney,1980
81333,1230,1989-12-29,Jeopardy!,HODGEPODGE,$100,During WWII he was head of the Kuomintang party & commander of the Chinese army,Chiang Kai-shek,1980
81378,1230,1989-12-29,Double Jeopardy!,HISTORIC QUOTES,$800,"""Turn On, Tune In, Drop Out"" was the title of a lecture he gave in 1967",Dr. Timothy Leary,1980

In [32]:
decade_filter = lambda year: int(year//10 * 10)
decade = data.air_date.dt.year.apply(decade_filter)
data['decade'] = decade

In [43]:
decade_counts = data.groupby('decade').show_number.count()
decade_counts

decade
1980      8108
1990     56745
2000    123852
2010     28225
Name: show_number, dtype: int64

In [44]:
decade_counts[1980]

8108

In [38]:
computer_df = jp.filtered_df(data, ['Computer'])
computer_df

,show_number,air_date,round,category,value,question,answer,decade
342,5690,2009-05-08,Double Jeopardy!,MATHEM-ATTACK!,$1200,"(<a href=""http://www.j-archive.com/media/2009-05-08_DJ_28.jpg"" target=""_blank"">Kelly of the Clue Crew shows an array of numbers enclosed in brackets on the monitor.</a>) A set of numbers in rows and columns can be used in many ways--for example, to encrypt a code or create 3-D computer graphics; the set shares this name with a 1999 film",a matrix,2000
1106,4085,2002-05-10,Double Jeopardy!,"""EN"" THE BEGINNING",$800,"2-word term for the consumer, for whom a computer is ultimately designed",an end user,2000
1430,4960,2006-03-17,Jeopardy!,RECORD LOSSES IN 2005,$200,"A computer with 98,000 names & SSNs was reported stolen from this oldest campus of the Univ. of Calif.",Berkeley,2000
4106,5797,2009-11-24,Double Jeopardy!,"""PH""UN WORDS",$400,"From the Greek for ""shape"", it means to transform an image into something else by computer",morph,2000
4615,5512,2008-07-22,Double Jeopardy!,SLEEP,$2000,"(<a href=""http://www.j-archive.com/media/2008-07-22_DJ_26.wmv"">Sarah of the Clue Crew points to a brain on a computer screen at the Sleep Research Center at Stanford University.</a>) <a href=""http://www.j-archive.com/media/2008-07-22_DJ_26a.jpg"" target=""_blank"">This</a> part of the brain that connects to the spinal cord is vital for dreaming, as it produces chemicals that keep other parts of the brain active",the medulla oblongata (or the brain stem),2000
...,...,...,...,...,...,...,...,...
215116,6036,2010-12-06,Double Jeopardy!,"WHAT HAPPENED TO THE ""MOTHER""s?",$400,The main circuitry of a computer is found here,the motherboard,2010
215539,4216,2002-12-23,Double Jeopardy!,WORDS WITHIN WORDS,$1600,You may have to do this to a computer disk to enable it to store information,format (in(format)ion),2000
216299,5236,2007-05-21,Double Jeopardy!,FORBES' CARS FOR THE RICH,$400,This get personal for a personal computer mogul Michael Dell in a 2005 H2 from this manufacturer,Hummer,2000
216527,3038,1997-11-12,Jeopardy!,COMPUTERESE,$400,"Like a waiter, a network computer might say ""I'll be your"" this & store files or manage printers",Server,1990
216533,3038,1997-11-12,Jeopardy!,COMPUTERESE,$500,"""Strap"" once completed this word meaning to start a computer by loading software",Boot,1990

In [39]:
computer_df.air_date.describe()

count                     315
unique                    280
top       2007-01-03 00:00:00
freq                        5
first     1984-12-12 00:00:00
last      2012-01-25 00:00:00
Name: air_date, dtype: object

In [42]:
computer_df_decade = computer_df.groupby(['decade'])['show_number'].count().reset_index()
computer_df_decade

   decade  show_number
0    1980            5
1    1990           66
2    2000          197
3    2010           47

In [50]:
percentage = lambda row: row['show_number']/decade_counts[row['decade']]*100
computer_df_decade['proportion_of_total'] = computer_df_decade.apply(percentage, axis=1)

In [51]:
computer_df_decade

   decade  show_number  proportion_of_total
0    1980            5             0.061667
1    1990           66             0.116310
2    2000          197             0.159061
3    2010           47             0.166519

In [63]:
sorted_df = data.groupby(['air_date', 'category']).count().reset_index()['category'].value_counts()
sorted_df.head(50)

BEFORE & AFTER             115
SCIENCE                    110
LITERATURE                 108
WORD ORIGINS               102
AMERICAN HISTORY            98
STATE CAPITALS              88
WORLD HISTORY               85
POTPOURRI                   83
U.S. CITIES                 83
WORLD GEOGRAPHY             83
BUSINESS & INDUSTRY         82
U.S. PRESIDENTS             81
SPORTS                      77
WORLD CAPITALS              76
ISLANDS                     75
ANIMALS                     75
COLLEGES & UNIVERSITIES     75
FICTIONAL CHARACTERS        71
BODIES OF WATER             71
HISTORY                     70
RELIGION                    69
AUTHORS                     68
OPERA                       67
U.S. GEOGRAPHY              67
SHAKESPEARE                 66
TELEVISION                  65
TRANSPORTATION              64
BALLET                      63
AMERICANA                   63
LANGUAGES                   62
U.S. HISTORY                61
THE BIBLE                   61
PEOPLE                      60
HISTORIC NAMES              59
AMERICAN LITERATURE         59
GEOGRAPHY                   57
ART                         57
RHYME TIME                  56
ART & ARTISTS               55
FOOD                        55
HOLIDAYS & OBSERVANCES      54
STUPID ANSWERS              54
BOOKS & AUTHORS             54
THE MOVIES                  54
MUSEUMS                     53
POP MUSIC                   52
ORGANIZATIONS               52
CLASSICAL MUSIC             52
WORLD LEADERS               51
WORLD CITIES                51
Name: category, dtype: int64

In [64]:
literature_df = jp.filtered_df(data, ['literature'])

In [151]:
ser = literature_df.groupby('round').show_number.count()
s = ser.sum()
ser.rename('count')

round
Double Jeopardy!    68
Final Jeopardy!      8
Jeopardy!           42
Name: count, dtype: int64

In [153]:
ser.apply(lambda x: x/s).rename('proportion_of_total')

round
Double Jeopardy!    0.576271
Final Jeopardy!     0.067797
Jeopardy!           0.355932
Name: proportion_of_total, dtype: float64

In [150]:
# a = ss.to_frame().reset_index().rename(columns = {'show_number': 'proportion_of_total'})
# b = ser.to_frame().reset_index().rename(columns = {'show_number': 'count'})
pd.merge(ser, ss, on='round').reset_index().rename(columns = {'show_number': 'proportion_of_total'})

              round  show_number_x  show_number_y
0  Double Jeopardy!             68       0.576271
1   Final Jeopardy!              8       0.067797
2         Jeopardy!             42       0.355932

In [154]:
def round_counts(data, word):
    
    df = jp.filtered_df(data, word.split())
    round_counts = df.groupby('round').show_number.count().rename('count')
    round_sum = round_counts.sum()
    round_percentage = round_counts.apply(lambda count: round(count/round_sum, 2)).rename('proportion_of_total')
   
    return pd.merge(round_counts, round_percentage, on='round').reset_index()

In [155]:
round_counts(data, 'president')

              round  count  proportion_of_total
0  Double Jeopardy!   1309                 0.50
1   Final Jeopardy!    127                 0.05
2         Jeopardy!   1192                 0.45

In [156]:
round_counts(data, 'computer')

              round  count  proportion_of_total
0  Double Jeopardy!    141                 0.45
1   Final Jeopardy!      2                 0.01
2         Jeopardy!    172                 0.55

In [157]:
round_counts(data, 'literature')

              round  count  proportion_of_total
0  Double Jeopardy!     68                 0.58
1   Final Jeopardy!      8                 0.07
2         Jeopardy!     42                 0.36

In [158]:
round_counts(data, 'country')

              round  count  proportion_of_total
0  Double Jeopardy!   2186                 0.51
1   Final Jeopardy!    112                 0.03
2         Jeopardy!   1961                 0.46

In [159]:
round_counts(data, 'king england')

              round  count  proportion_of_total
0  Double Jeopardy!     44                 0.59
1   Final Jeopardy!      1                 0.01
2         Jeopardy!     29                 0.39

In [160]:
round_counts(data, 'leader born')

              round  count  proportion_of_total
0  Double Jeopardy!     20                 0.80
1   Final Jeopardy!      1                 0.04
2         Jeopardy!      4                 0.16

## Solution

7. Compare your program to our <a href="https://content.codecademy.com/PRO/independent-practice-projects/jeopardy/jeopardy_solution.zip">sample solution code</a> - remember, that your program might look different from ours (and probably will) and that's okay!

8. Great work! Visit <a href="https://discuss.codecademy.com/t/this-is-jeopardy-challenge-project-python-pandas/462365">our forums</a> to compare your project to our sample solution code. You can also learn how to host your own solution on GitHub so you can share it with other learners! Your solution might look different from ours, and that's okay! There are multiple ways to solve these projects, and you'll learn more by seeing others' code.